{
  "projectsTitle": "Projetos pessoais",
  "projectsDescription": "Sempre faço um projeto quando quero aprender uma tecnologia nova ou desafiar-me com algo criativo.",
  "technologies": "Tecnologias usadas",
  "projectDate": "Data do projeto",
  "learnedLessons": "Lições para o futuro",
  "projectName1": "Site com Navegação 2D",
  "projectImageAlt1": "Imagem do projeto Site com Navegação 2D. A imagem mostra um cenário de um mapa RPG com um personagem em destaque.",
  "projectDescription1": "Senti vontade de testar uma navegação 2D similar a um RPG com colisões e navegação entre mapas mas sem uso de bibliotecas focadas em jogos ou do uso de canvas. O site foi feito com React, Next e Tailwind. O site é responsivo e possui um sistema de navegação por teclado e por toque na tela.",
  "projectLessons1": "Falta de suporte para IOS, poderia ter um sistema de interação com objetos do cenário",
  "projectName2": "Radiant Lobby",
  "projectImageAlt2": "Imagem do projeto Radiant Lobby",
  "projectDescription2": "A ideia foi estudar requisições em APIs para criar um site sobre coisas do jogo Valorant. O site contém um sistema básico de login com o Firebase, sendo possível favoritar Skins e itens do jogo, vinculando a sua conta. O Site foi feito em React com Next.js e Styled Components.",
  "projectLessons2": "Componentes mal projetados, falta de paginação e sistema de busca, mal desempenho por conta das animações complexas, falta de internacionalização.",
  "projectName3": "Pizzaria do Luigi",
  "projectImageAlt3": "Imagem do projeto Luigi's Pizzeria. A imagem tem um fundo verde, com o personagem Luigi do jogo Mario Bros segurando uma pizza.",
  "projectDescription3": "Um projeto simples de landing page para uma pizzaria fictícia. O site foi feito com React e Styled Components. O intuito foi treinar o uso do localStorage do navegador para guardar informações do carrinho de pedidos.",
  "projectLessons3": "Má utilização do styled components, poderia haver um sistema de login para salvar os pedidos no servidor.",
  "thirdPartyApi": "API de terceiros",
  "visitProject": "Visitar projeto",
  "viewCode": "Ver código",
  "viewDetails": "Ver detalhes",
  "openViewDetails": "Abrir modal detalhes",
  "closeViewDetails": "Fechar modal detalhes",
  "visitProjectLabel": "Abre o site do projeto em uma nova aba",
  "viewCodeLabel": "Abre o Github projeto em uma nova aba"
}
